interface SpecializationItem {
  [key: string]: { id: string; text: string }[];
}

// 전문분야
export const SPECIALIZATION: SpecializationItem[] = [
  {
    "문학": [
      { id: "1-1", text: "시소설" },
      { id: "1-2", text: "희곡" },
      { id: "1-3", text: "수필" },
      { id: "1-4", text: "아동문학" },
    ]
  },
  {
    "시각예술": [
      { id: "2-1", text: "회화" },
      { id: "2-2", text: "조각" },
      { id: "2-3", text: "사진" },
      { id: "2-4", text: "설치미술" },
      { id: "2-5", text: "미디어아트 (영상, 뉴미디어)" },
      { id: "2-6", text: "디자인" },
      { id: "2-7", text: "공예" },
    ]
  },
  {
    "공연예술": [
      { id: "3-1", text: "연극" },
      { id: "3-2", text: "뮤지컬" },
      { id: "3-3", text: "무용 (현대무용, 발레, 전통무용 등)" },
      { id: "3-4", text: "음악 (기약, 성악)" },
      { id: "3-5", text: "오페라" },
      { id: "3-6", text: "국악 (연주, 판소리, 창극 등)" },
      { id: "3-7", text: "공연 연출 및 기획" },
    ]
  },
  {
    "음악": [
      { id: "4-1", text: "클래식 (기악, 성악, 지휘)" },
      { id: "4-2", text: "대중음악 (가요, 록, 힙합, 재즈 등)" },
      { id: "4-3", text: "전통음악 (국악, 전통악기 연주)" },
      { id: "4-4", text: "작곡" },
      { id: "4-5", text: "지휘" },
      { id: "4-6", text: "영화음악, 게임음악" },
      { id: "4-7", text: "사운드 아트" },
    ]
  },
  {
    "전통예술": [
      { id: "5-1", text: "전통음악 (국악, 판소리 등)" },
      { id: "5-2", text: "전통무용" },
      { id: "5-3", text: "전통연희 (탈춤, 줄타기 등)" },
      { id: "5-4", text: "전통공예" },
      { id: "5-5", text: "전통연극 (창극)" },
    ]
  },
  {
    "미디어 예술": [
      { id: "6-1", text: "영상예술 (단편영화, 장편영화, 독립영화)" },
      { id: "6-2", text: "애니메이션" },
      { id: "6-3", text: "게임 및 인터랙티브 미디어" },
      { id: "6-4", text: "디지털 아트" },
      { id: "6-5", text: "VR/AR 예술" },
      { id: "6-6", text: "멀티미디어 퍼포먼스" },
    ]
  },
  {
    "건축": [
      { id: "7-1", text: "건축설계" },
      { id: "7-2", text: "도시계획" },
      { id: "7-3", text: "실내디자인" },
      { id: "7-4", text: "환경디자인" },
    ]
  },
  {
    "다원예술": [
      { id: "8-1", text: "복합장르 예술 (융합 예술)" },
      { id: "8-2", text: "퍼포먼스 아트" },
      { id: "8-3", text: "사운드 아트" },
      { id: "8-4", text: "미디어와 퍼포먼스 결합" },
    ]
  },
  {
    "연구 및 기획": [
      { id: "9-1", text: "문화예술 기획 및 연출" },
      { id: "9-2", text: "예술경영" },
      { id: "9-3", text: "예술 교육" },
      { id: "9-4", text: "문화정책연구" },
    ]
  }
];
